<script>
  import { initializeApp } from "firebase/app";
  import { getDatabase, ref, child, get, set, push } from "firebase/database";
  import { Modal, Button } from "flowbite-svelte";
  // 파이어베이스 접근권한 필요요소
  const firebaseConfig = {
    apiKey: "AIzaSyCQLaKjFWCt67i-1gZ0XkhzR6UBRE0diMA",
    authDomain: "signature-514.firebaseapp.com",
    databaseURL:
      "https://signature-514-default-rtdb.asia-southeast1.firebasedatabase.app",
    projectId: "signature-514",
    storageBucket: "signature-514.appspot.com",
    messagingSenderId: "876239622279",
    appId: "1:876239622279:web:01f16832de6b22e99fa822",
  };
  let defaultModal = false;

  // 파이어베이스 실행 함수
  initializeApp(firebaseConfig);

  // 파이어베이스 db로부터 데이터 불러오기
  const db = getDatabase();
  let items = {};
  const dbRef = ref(getDatabase());
  
  get(child(dbRef, `posts`))
    .then((snapshot) => {
      if (snapshot.exists()) {
        items = snapshot.val();
      } else {
        console.log("No data available");
      }
    })
    .catch((error) => {
      console.error(error);
    });

  // 방명록 데이터
  const data = [
    //히포 직원 데이터
    {
      이름: "김우진",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "정신기",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "정준권",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "정태명",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "김동희",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "남기현",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "박민수",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "송영석",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "손하민",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "이준희",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "유주헌",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "이용호",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "이준구",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "정하림",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "이태화",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "한윤희",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "신대호",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "이은숙",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "박진주",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "이나라",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "이나현",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "이서후",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "현자윤",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "박우진",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "이경아",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "조민주",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "이동규",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "김남균",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "권민지",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "이슬기",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "이슬기",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "김남욱",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "임종민",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "안보미",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "임현아",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "에드워드 신",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
    {
      이름: "Pham Cong Vinh",
      소속: "히포티앤씨",
      테이블번호 : ""
    },
  {
    이름: "손애숙",
    소속: "틔움심리상담센터",
    테이블번호: 1
  },
  {
    이름: "오로사",
    소속: "다원아동발달센터",
    테이블번호: 1
  },
  {
    이름: "박진영1",
    소속: "한국인간과학연구소 분당",
    테이블번호: 1
  },
  {
    이름: "강치선",
    소속: "한양아이소리 인천심리상담센터",
    테이블번호: 1
  },
  {
    이름: "박정화",
    소속: "한국인간과학연구소 구로",
    테이블번호: 1
  },
  {
    이름: "채숙희",
    소속: "분당심리센터 내마음쓰담",
    테이블번호: 1
  },
  {
    이름: "정정화",
    소속: "광주임상심리클리닉",
    테이블번호: 1
  },
  {
    이름: "이지훈1",
    소속: "엠브레스마인드 심리상담센터 분당본점",
    테이블번호: 1
  },
  {
    이름: "윤남희",
    소속: "로뎀나무 상담센터",
    테이블번호: 1
  },
  {
    이름: "송영선",
    소속: "RS에듀컨설팅",
    테이블번호: 2
  },
  {
    이름: "김영은",
    소속: "허그맘허그인심리상담센터 대구달서점",
    테이블번호: 2
  },
  {
    이름: "김상철",
    소속: "153심리상담센터",
    테이블번호: 2
  },
  {
    이름: "곽동현",
    소속: "글로벌미래교육원 상담코칭센터",
    테이블번호: 2
  },
  {
    이름: "박석원",
    소속: "톰소여언어심리발달센터 인천점",
    테이블번호: 8
  },
  {
    이름: "권예솜",
    소속: "율겸행복비전연구소",
    테이블번호: 2
  },
  {
    이름: "황나연",
    소속: "율겸행복비전연구소",
    테이블번호: 2
  },
  {
    이름: "최인숙",
    소속: "이레해석심리상담센터",
    테이블번호: 2
  },
  {
    이름: "오명신",
    소속: "충남세종연구원 (Wee클래스)",
    테이블번호: 2
  },
  {
    이름: "임이랑",
    소속: "온빛심리재능상담센터",
    테이블번호: 2
  },
  {
    이름: "신동렬",
    소속: "성균관대학교",
    테이블번호: 3
  },
  {
    이름: "오명",
    소속: "-",
    테이블번호: 3
  },
  {
    이름: "김진형",
    소속: "카이스트",
    테이블번호: 4
  },
  {
    이름: "민원기",
    소속: "-",
    테이블번호: 3
  },
  {
    이름: "Beth Krone",
    소속: "Icahn School of Medicine / The Mount Sinai Hospital",
    테이블번호: 3
  },
  {
    이름: "황순조",
    소속: "Nebraska Medical Center Omaha",
    테이블번호: 3
  },
  {
    이름: "Jeffrey Newcorn",
    소속: "Icahn School of Medicine / The Mount Sinai Hospital",
    테이블번호: 3
  },
  {
    이름: "윤석진",
    소속: "EY한영",
    테이블번호: 3
  },
  {
    이름: "이석우",
    소속: "두나무",
    테이블번호: 4
  },
  {
    이름: "최정웅",
    소속: "디에스자산운용",
    테이블번호: 4
  },
  {
    이름: "김형준",
    소속: "제이커브",
    테이블번호: 4
  },
  {
    이름: "안상준",
    소속: "코오롱 인베스트먼트",
    테이블번호: 4
  },
  {
    이름: "강기석",
    소속: "파마리서치",
    테이블번호: 4
  },
  {
    이름: "이원찬",
    소속: "KG 에듀원",
    테이블번호: 4
  },
  {
    이름: "박은준",
    소속: "PTR자산운용",
    테이블번호: 5
  },
  {
    이름: "양유석",
    소속: "히포티앤씨",
    테이블번호: 4
  },
  {
    이름: "정민규",
    소속: "메티스톤에퀴티파트너스",
    테이블번호: 5
  },
  {
    이름: "김인선",
    소속: "메티스톤에퀴티파트너스",
    테이블번호: 5
  },
  {
    이름: "이재형",
    소속: "위키씨알오",
    테이블번호: 5
  },
  // {
  //   이름: "강현준",
  //   소속: "펜처인베스트",
  //   테이블번호: 5
  // },
  {
    이름: "이문규",
    소속: "씨앤벤처파트너스",
    테이블번호: 5
  },
  {
    이름: "안창훈",
    소속: "씨앤벤처파트너스",
    테이블번호: 8
  },
  {
    이름: "김혜원",
    소속: "씨앤벤처파트너스",
    테이블번호: 8
  },
  {
    이름: "이지현",
    소속: "젠엑시스",
    테이블번호: 5
  },
  {
    이름: "임성호",
    소속: "트랜스링크 인베스트먼트",
    테이블번호: 5
  },
  // {
  //   이름: "장나연",
  //   소속: "사회자",
  //   테이블번호: 6
  // },
  {
    이름: "이윤아",
    소속: "SBS",
    테이블번호: 10
  },
  {
    이름: "오홍권",
    소속: "웅진",
    테이블번호: 6
  },
  {
    이름: "김진각",
    소속: "웅진",
    테이블번호: 6
  },
  {
    이름: "정윤희",
    소속: "일이육㈜",
    테이블번호: 19
  },
  {
    이름: "박현호",
    소속: "일이육㈜",
    테이블번호: 19
  },
  {
    이름: "정현석",
    소속: "라온아이 오토캠핑장",
    테이블번호: 6
  },
  {
    이름: "지상수",
    소속: "마니코리아",
    테이블번호: 6
  },
  {
    이름: "이은희",
    소속: "한국인간과학 분당연구소",
    테이블번호: 7
  },
  {
    이름: "문미라",
    소속: "한국인간과학 분당연구소",
    테이블번호: 7
  },
  {
    이름: "김유진",
    소속: "한국인간과학연구소",
    테이블번호: 7
  },
  {
    이름: "한상순",
    소속: "한국인간과학연구소",
    테이블번호: 7
  },
  {
    이름: "장순화",
    소속: "한국인간과학연구소",
    테이블번호: 7
  },
  {
    이름: "김철웅",
    소속: "한국인간과학연구소",
    테이블번호: 7
  },
  {
    이름: "강신복",
    소속: "한국인간과학연구소 강북/노원",
    테이블번호: 7
  },
  {
    이름: "한만영",
    소속: "NSC정보시스템",
    테이블번호: 7
  },
  {
    이름: "황미영",
    소속: "명지대학교",
    테이블번호: 8
  },
  {
    이름: "선우현",
    소속: "명지대학교",
    테이블번호: 8
  },
  {
    이름: "최광현",
    소속: "한세대학교",
    테이블번호: 8
  },
  {
    이름: "김정태",
    소속: "동양대학교",
    테이블번호: 8
  },
  {
    이름: "제강호",
    소속: "법무법인 김장리",
    테이블번호: 6
  },
  {
    이름: "이정배",
    소속: "부산외국어대학교",
    테이블번호: 5
  },
  {
    이름: "이홍구",
    소속: "수산아이앤티",
    테이블번호: 4
  },
  {
    이름: "이웅재",
    소속: "인성정보",
    테이블번호: 8
  },
  {
    이름: "이상훈",
    소속: "전 국가기술표준원",
    테이블번호: 8
  },
  {
    이름: "윤희정",
    소속: "주식회사 와이에이",
    테이블번호: 7
  },
  {
    이름: "김선경",
    소속: "이화여자대학교 아동발달센터",
    테이블번호: 9
  },
  {
    이름: "정사영",
    소속: "가천대학교 대학원",
    테이블번호: 9
  },
  {
    이름: "양수빈",
    소속: "가천대학교 대학원",
    테이블번호: 9
  },
  {
    이름: "김윤주",
    소속: "가천대학교 대학원 우리아이언어",
    테이블번호: 9
  },
  {
    이름: "박현주",
    소속: "가천대학교",
    테이블번호: 9
  },
  {
    이름: "이주영",
    소속: "동덕여자대학교 아동학과",
    테이블번호: 13
  },
  {
    이름: "권미경",
    소속: "서울여자대학교",
    테이블번호: 9
  },
  {
    이름: "정태연",
    소속: "중앙대학교 심리학과",
    테이블번호: 9
  },
  {
    이름: "강지현",
    소속: "동덕여자대학교 아동학과",
    테이블번호: 13
  },
  {
    이름: "도례미",
    소속: "서울대학교병원",
    테이블번호: 13
  },
  {
    이름: "허찬영",
    소속: "분당서울대병원 성형외과",
    테이블번호: 10
  },
  {
    이름: "박규형",
    소속: "분당서울대학병원",
    테이블번호: 10
  },
  {
    이름: "최연호",
    소속: "삼성서울병원 소아과",
    테이블번호: 10
  },
  {
    이름: "김미진",
    소속: "삼성서울병원 소아과",
    테이블번호: 10
  },
  {
    이름: "박지웅",
    소속: "서울시보라매병원 성형외과",
    테이블번호: 10
  },
  {
    이름: "나해란",
    소속: "나해란 정신건강의학과",
    테이블번호: 10
  },
  {
    이름: "오수환",
    소속: "삼성창원병원 정신건강의학과",
    테이블번호: 10
  },
  {
    이름: "안지현",
    소속: "서울삼성병원 정신건강의학과",
    테이블번호: 10
  },
  {
    이름: "박호건",
    소속: "성균관대학교",
    테이블번호: 11
  },
  {
    이름: "최기호",
    소속: "성균관대학교 글로벌창업대학원",
    테이블번호: 11
  },
  {
    이름: "전일용",
    소속: "성균관대학교",
    테이블번호: 11
  },
  {
    이름: "최희윤",
    소속: "한양대학교",
    테이블번호: 11
  },
  {
    이름: "이정희",
    소속: "삼성서울병원 영상의학과",
    테이블번호: 11
  },
  {
    이름: "정성권",
    소속: "성균관대학교 의과대학",
    테이블번호: 11
  },
  {
    이름: "김유성",
    소속: "성균관대학교",
    테이블번호: 11
  },
  {
    이름: "이지형",
    소속: "성균관대학교",
    테이블번호: 11
  },
  {
    이름: "김문현",
    소속: "히포티앤씨",
    테이블번호: 11
  },
  {
    이름: "강희나",
    소속: "허그맘허그인",
    테이블번호: 12
  },
  {
    이름: "이미란",
    소속: "허그맘허그인",
    테이블번호: 12
  },
  {
    이름: "임문자",
    소속: "힐링맘 상담센터",
    테이블번호: 12
  },
  {
    이름: "정진용",
    소속: "히포티앤씨",
    테이블번호: 12
  },
  {
    이름: "안미리",
    소속: "히포티앤씨",
    테이블번호: 12
  },
  {
    이름: "송유정",
    소속: "동덕여자대학교 대학원",
    테이블번호: 12
  },
  {
    이름: "박소미",
    소속: "동덕여자대학교 대학원",
    테이블번호: 12
  },
  {
    이름: "김현정",
    소속: "행복심리상담센터 밝음",
    테이블번호: 12
  },
  {
    이름: "이지원",
    소속: "행복심리상담센터 밝음",
    테이블번호: 12
  },
  {
    이름: "오지연",
    소속: "동덕여자대학교 대학원",
    테이블번호: 13
  },
  {
    이름: "박준선",
    소속: "동덕여자대학교 대학원",
    테이블번호: 13
  },
  {
    이름: "이유재",
    소속: "동덕여자대학교 대학원",
    테이블번호: 13
  },
  {
    이름: "구솔비",
    소속: "동덕여자대학교 대학원",
    테이블번호: 13
  },
  {
    이름: "이하림",
    소속: "동덕여자대학교 대학원",
    테이블번호: 13
  },
  {
    이름: "이선영",
    소속: "동덕여자대학교 대학원",
    테이블번호: 13
  },
  {
    이름: "오재동",
    소속: "성균관대학교 글로벌융합학부",
    테이블번호: 15
  },
  {
    이름: "김미래",
    소속: "성균관대학교 글로벌융합학부",
    테이블번호: 15
  },
  {
    이름: "이정균",
    소속: "성균관대학교 글로벌융합학부",
    테이블번호: 15
  },
  {
    이름: "이정진",
    소속: "그로잉스텝 마음상담소",
    테이블번호: 14
  },
  {
    이름: "공지윤",
    소속: "동덕여자대학교 대학원",
    테이블번호: 14
  },
  {
    이름: "배주현",
    소속: "동덕여자대학교 대학원",
    테이블번호: 14
  },
  {
    이름: "홍미래",
    소속: "동덕여자대학교 대학원",
    테이블번호: 14
  },
  {
    이름: "박채원",
    소속: "동덕여자대학교 대학원",
    테이블번호: 14
  },
  {
    이름: "채하은",
    소속: "동덕여자대학교 대학원",
    테이블번호: 14
  },
  {
    이름: "김아라",
    소속: "마음과사람",
    테이블번호: 14
  },
  {
    이름: "이지훈2",
    소속: "마음과사람",
    테이블번호: 14
  },
  {
    이름: "조경선",
    소속: "진로진학학습코칭협의회",
    테이블번호: 15
  },
  {
    이름: "김지혜",
    소속: "연세대학교 심리학과 대학원",
    테이블번호: 15
  },
  {
    이름: "이서이",
    소속: "연세대학교 심리학과 대학원",
    테이블번호: 15
  },
  {
    이름: "정은선",
    소속: "연세대학교 심리학과 대학원",
    테이블번호: 15
  },
  {
    이름: "김민희",
    소속: "연세대학교 심리학과 대학원",
    테이블번호: 15
  },
  {
    이름: "정경미",
    소속: "연세대학교 심리학과",
    테이블번호: 15
  },
  {
    이름: "김하림",
    소속: "연세대학교 심리학과 대학원",
    테이블번호: 15
  },
  {
    이름: "박현진",
    소속: "마음사랑상담센터",
    테이블번호: 16
  },
  {
    이름: "이은식",
    소속: "마인드빅 상담센터",
    테이블번호: 16
  },
  {
    이름: "고혜정",
    소속: "마인드빅 상담센터",
    테이블번호: 16
  },
  {
    이름: "김혜영",
    소속: "마인드빅 상담센터",
    테이블번호: 16
  },
  {
    이름: "양윤란",
    소속: "마인드빅 상담센터",
    테이블번호: 16
  },
  {
    이름: "이경희",
    소속: "마인드빅 상담센터",
    테이블번호: 16
  },
  {
    이름: "박규리",
    소속: "마인드케어 센터",
    테이블번호: 9
  },
  {
    이름: "백종수",
    소속: "마인드케어 센터",
    테이블번호: 9
  },
  {
    이름: "강화연",
    소속: "싱그래예술심리상담소",
    테이블번호: 16
  },
  {
    이름: "한미미",
    소속: "색채심리분석연구소 온",
    테이블번호: 16
  },
  {
    이름: "김민수",
    소속: "안산지역연구소",
    테이블번호: 17
  },
  {
    이름: "신지원",
    소속: "엠브레스마인드",
    테이블번호: 17
  },
  {
    이름: "박진영2",
    소속: "엠브레스마인드",
    테이블번호: 17
  },
  {
    이름: "구자엽",
    소속: "엠브레스마인드",
    테이블번호: 17
  },
  {
    이름: "김만권",
    소속: "연우심리개발원",
    테이블번호: 17
  },
  {
    이름: "차유정",
    소속: "율겸행복비전연구소",
    테이블번호: 17
  },
  {
    이름: "최주승",
    소속: "로뎀나무상담센터",
    테이블번호: 17
  },
  {
    이름: "김선희",
    소속: "서울여자대학교",
    테이블번호: 18
  },
  {
    이름: "심종온",
    소속: "서초아이존",
    테이블번호: 18
  },
  {
    이름: "김미경",
    소속: "아동청소년심리지원서비스 기관",
    테이블번호: 18
  },
  {
    이름: "김미례",
    소속: "인간과학연구소",
    테이블번호: 18
  },
  {
    이름: "김영란",
    소속: "대치 미래인재교육연구소",
    테이블번호: 18
  },
  {
    이름: "서정민",
    소속: "딥씽킹 교육연구소",
    테이블번호: 18
  },
  {
    이름: "박미정",
    소속: "두드림비전코칭센터",
    테이블번호: 18
  },
  {
    이름: "김기설",
    소속: "서원구연구소",
    테이블번호: 17
  },
  {
    이름: "김선미",
    소속: "동아일보",
    테이블번호: 3
  },
  {
    이름: "홍하나",
    소속: "바이라인 네트워크",
    테이블번호: 19
  },
  {
    이름: "정현정",
    소속: "전자신문",
    테이블번호: 19
  },
  {
    이름: "박기택",
    소속: "청년의사",
    테이블번호: 6
  },
  {
    이름: "이진",
    소속: "IT조선",
    테이블번호: 6
  },
  {
    이름: "김경묵",
    소속: "ZDNet Korea",
    테이블번호: 6
  },
  {
    이름: "김영휴",
    소속: "씨크릿우먼",
    테이블번호: 18
  },
  {
    이름: "문승훈",
    소속: "씨크릿우먼",
    테이블번호: 18
  },
  {
    이름: "심윤수",
    소속: "히포티앤씨",
    테이블번호: 19
  },
  {
    이름: "성백훈",
    소속: "히포티앤씨",
    테이블번호: 19
  },
  {
    이름: "직원1",
    소속: "",
    테이블번호: 19
  },
  {
    이름: "직원2",
    소속: "",
    테이블번호: 19
  },
    
  ];
  // const obj = {};
  // data.map((item) =>
  //   obj[item.이름] ? obj[item.이름]++ : (obj[item.이름] = 1)
  // );
  // Object.entries(obj).map(([key, value]) => {
  //   if (value != 1) console.log(key, value);
  // });
  // 파이어베이스 유저 입력
  function addUser(name, team,tableNum) {
    const postListRef = ref(db, "posts");
    const newPostRef = push(postListRef);
    set(newPostRef, {
      attend: false,
      name,
      img_src: "",
      team,
      tableNum,
    });
  }

  const click = () => data.map((item) => addUser(item.이름, item.소속, item.테이블번호));
  let filterValue = -1;
  let img = "";
  let sign_name = "";
  let table_N="";
  let clickedName;

  $: {
    if (filterValue === -1) {
      clickedName = "모두";
    } else if (filterValue === 1) {
      clickedName = "참석";
    }
    if (filterValue === 0) {
      clickedName = "불참석";
    }
  }

  $: console.log(img);
</script>

<header class="z-fixed header-fixed-top">
  <nav class="navbar navbar-expand-lg navbar-light bg-body shadow-lg">
    <div class="container">
      <div class="position-relative">
        <button
          class="mx-2 bg-green-200 px-4 py-2 rounded-lg font-KotraBold"
          on:click={() => (filterValue = -1)}>모두</button
        >
        <button
          class="mx-2 bg-blue-300 px-4 py-2 rounded-lg font-KotraBold"
          on:click={() => (filterValue = 1)}>참석</button
        >
        <button
          class="mx-2 bg-red-300 px-4 py-2 rounded-lg font-KotraBold"
          on:click={() => (filterValue = 0)}>불참석</button
        >
        <!-- // 테스트용 DB 추가 함수
        <button on:click={click}>추가</button> -->
      </div>
    </div>
  </nav>
</header>
<div class="px-2 pt-9 pb-4">
  <div class="row justify-content-center">
    <div class="col-12">
      <div class="d-flex mb-4 align-items-center">
        <h6 class="mb-0 font-TmoneyRoundWind">참가자 명단 ({clickedName})</h6>
        &nbsp
        <div class="border-bottom flex-grow-1" />
      </div>

      <table class="table mb-9 table-bordered">
        <thead>
          <tr class="text-center">
            <th scope="col" class="col col-3">이름</th>
            <th scope="col" class="col col-5">소속</th>
            <th scope="col" class="col col-4">참석여부</th>
            <th scope="col" class="col col-1">No</th>
          </tr>
        </thead>
        <tbody class="text-left">
          {#each Object.entries(items)
            .map(([_, value]) => value)
            .filter( (value) => (filterValue === -1 ? true : value.attend == filterValue) )
            .sort( (a, b) => (a.name < b.name ? -1 : a.name > b.name ? 1 : 0) ) as value}
            <tr>
              <td class="px-2 text-[15px] font-bold">{value.name}</td>
              <td class="px-2 text-[14px] align-middle">{value.team}</td>
              <td class="px-2 text-center">
                {#if value.attend && value.img_src}
                <Button size="xs"
                class="btn btn-success"
                on:click={() => {
                  defaultModal = true;
                  img = value.img_src;
                  sign_name = value.name;
                  table_N = value.tableNum;
                }}>싸인</Button
                  >
                  {/if}
                </td>
                <td class="px-2 text-[14px] text-center font-bold align-middle">
                  {value.tableNum}
                </td>             
            </tr>
          {/each}
        </tbody>
      </table>
    </div>
  </div>
</div>

<Modal
  title={`${sign_name}님의 싸인`}
  bind:open={defaultModal}
  autoclose
  class="w-[368px] h-[461px]"
>
  <img
    src={`https://firebasestorage.googleapis.com/v0/b/signature-514.appspot.com/o/signatures%2F${img}.png?alt=media&token=5abf4577-0ca3-47ac-bf7d-f1d523e7046d`}
    alt="signature"
  />

  <svelte:fragment slot="footer">
    <Button on:click={() => (defaultModal = false)} class="btn btn-success"
      >close</Button
    >
  </svelte:fragment>
</Modal>
